Revit 2027 API
AlphanumericRevisionSettings Constructor
Overload List
Name | Description
AlphanumericRevisionSettings() |  Constructs an AlphanumericRevisionSettings with a simple, default sequence.
AlphanumericRevisionSettings(AlphanumericRevisionSettings) |  Constructs a new copy of the input AlphanumericRevisionSettings object.
AlphanumericRevisionSettings(IList<String>, String, String) |  Constructs an AlphanumericRevisionSettings object.
Top
See Also
Reference
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace